In [2]:
import pandas as pd
import psycopg2
import sqlalchemy
import matplotlib as plt

%matplotlib inline

In [3]:
# !pip install ipython-sql
# !pip install sqlalchemy
# !pip install psycopg2

In [4]:
%load_ext sql
from sqlalchemy import create_engine

In [5]:
# Format
# %sql dialect+driver://username:password@host:port/database
# Example format
%sql postgresql://postgres:postgres@localhost:5432/mimic

In [6]:
# Format
# engine = create_engine('dialect+driver://username:password@host:port/database')
# Example format
engine = create_engine('postgresql://postgres:postgres@localhost:5432/mimic')

In [7]:
import json
json_file = open("secrets.json")
variables = json.load(json_file)
json_file.close()

import os
os.environ['POSTGRES_USERNAME'] = variables['POSTGRES_USERNAME']
os.environ['POSTGRES_PASSWORD'] = variables['POSTGRES_PASSWORD']
os.environ['POSTGRES_ADDRESS'] = variables['POSTGRES_ADDRESS']
os.environ['POSTGRES_PORT'] = variables['POSTGRES_PORT']
os.environ['POSTGRES_DBNAME'] = variables['POSTGRES_DBNAME']

In [8]:
# A long string that contains the necessary Postgres login information 
postgres_str = ('postgresql://{username}:{password}@{ipaddress}:{port}/{dbname}'
                .format(username=os.getenv('POSTGRES_USERNAME'),
                        password=os.getenv('POSTGRES_PASSWORD'),
                        ipaddress=os.getenv('POSTGRES_ADDRESS'),
                        port=os.getenv('POSTGRES_PORT'),
                        dbname=os.getenv('POSTGRES_DBNAME'))) 
# Create the connection 
engine = create_engine(postgres_str)

## Query Sandbox

In [9]:
# FORMAT FOR QUERIES SINCE THE SCHEMA ISN'T PUBLIC:
# SELECT *
# FROM <schema>."my_table"

In [10]:
%%sql

SELECT *
FROM mimiciii."patients"
WHERE gender = 'F'
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/mimic
5 rows affected.

[(234, 249, 'F', datetime.datetime(2075, 3, 13, 0, 0), None, None, None, 0),
 (235, 250, 'F', datetime.datetime(2164, 12, 27, 0, 0), datetime.datetime(2188, 11, 22, 0, 0), datetime.datetime(2188, 11, 22, 0, 0), None, 1),
 (238, 253, 'F', datetime.datetime(2089, 11, 26, 0, 0), None, None, None, 0),
 (241, 257, 'F', datetime.datetime(2031, 4, 3, 0, 0), datetime.datetime(2121, 7, 8, 0, 0), datetime.datetime(2121, 7, 8, 0, 0), datetime.datetime(2121, 7, 8, 0, 0), 1),
 (242, 258, 'F', datetime.datetime(2124, 9, 19, 0, 0), None, None, None, 0)]

In [11]:
%%sql
SELECT row_id, dod, subject_id, gender, dob, dod, dod_hosp, dod_ssn, expire_flag
FROM mimiciii."patients"
LIMIT 3;

 * postgresql://postgres:***@localhost:5432/mimic
3 rows affected.

[(234, None, 249, 'F', datetime.datetime(2075, 3, 13, 0, 0), None, None, None, 0),
 (235, datetime.datetime(2188, 11, 22, 0, 0), 250, 'F', datetime.datetime(2164, 12, 27, 0, 0), datetime.datetime(2188, 11, 22, 0, 0), datetime.datetime(2188, 11, 22, 0, 0), None, 1),
 (236, None, 251, 'M', datetime.datetime(2090, 3, 15, 0, 0), None, None, None, 0)]

In [12]:
%%sql

SELECT *
FROM information_schema.columns
WHERE table_name = 'patients'

gender, dob, dod, dod_hosp, dod_ssn, expire_flag

 * postgresql://postgres:***@localhost:5432/mimic
(psycopg2.errors.SyntaxError) syntax error at or near "gender"
LINE 4: gender, dob, dod, dod_hosp, dod_ssn, expire_flag
        ^

[SQL: SELECT * FROM information_schema.columns
WHERE table_name = 'patients'

gender, dob, dod, dod_hosp, dod_ssn, expire_flag]
(Background on this error at: http://sqlalche.me/e/f405)

In [13]:
%%sql

SELECT * FROM mimiciii."patients"
INNER JOIN mimiciii."admissions"
ON mimiciii."patients".subject_id = mimiciii."admissions".subject_id
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/mimic
10 rows affected.

[(1, 2, 'M', datetime.datetime(2138, 7, 17, 0, 0), None, None, None, 0, 1, 2, 163353, datetime.datetime(2138, 7, 17, 19, 4), datetime.datetime(2138, 7, 21, 15, 48), None, 'NEWBORN', 'PHYS REFERRAL/NORMAL DELI', 'HOME', 'Private', None, 'NOT SPECIFIED', None, 'ASIAN', None, None, 'NEWBORN', 0, 1),
 (2, 3, 'M', datetime.datetime(2025, 4, 11, 0, 0), datetime.datetime(2102, 6, 14, 0, 0), None, datetime.datetime(2102, 6, 14, 0, 0), 1, 2, 3, 145834, datetime.datetime(2101, 10, 20, 19, 8), datetime.datetime(2101, 10, 31, 13, 58), None, 'EMERGENCY', 'EMERGENCY ROOM ADMIT', 'SNF', 'Medicare', None, 'CATHOLIC', 'MARRIED', 'WHITE', datetime.datetime(2101, 10, 20, 17, 9), datetime.datetime(2101, 10, 20, 19, 24), 'HYPOTENSION', 0, 1),
 (3, 4, 'F', datetime.datetime(2143, 5, 12, 0, 0), None, None, None, 0, 3, 4, 185777, datetime.datetime(2191, 3, 16, 0, 28), datetime.datetime(2191, 3, 23, 18, 41), None, 'EMERGENCY', 'EMERGENCY ROOM ADMIT', 'HOME WITH HOME IV PROVIDR', 'Private', None, 'PROTESTANT QUAKER', 'SINGLE', 'WHITE', datetime.datetime(2191, 3, 15, 13, 10), datetime.datetime(2191, 3, 16, 1, 10), 'FEVER,DEHYDRATION,FAILURE TO THRIVE', 0, 1),
 (4, 5, 'M', datetime.datetime(2103, 2, 2, 0, 0), None, None, None, 0, 4, 5, 178980, datetime.datetime(2103, 2, 2, 4, 31), datetime.datetime(2103, 2, 4, 12, 15), None, 'NEWBORN', 'PHYS REFERRAL/NORMAL DELI', 'HOME', 'Private', None, 'BUDDHIST', None, 'ASIAN', None, None, 'NEWBORN', 0, 1),
 (5, 6, 'F', datetime.datetime(2109, 6, 21, 0, 0), None, None, None, 0, 5, 6, 107064, datetime.datetime(2175, 5, 30, 7, 15), datetime.datetime(2175, 6, 15, 16, 0), None, 'ELECTIVE', 'PHYS REFERRAL/NORMAL DELI', 'HOME HEALTH CARE', 'Medicare', 'ENGL', 'NOT SPECIFIED', 'MARRIED', 'WHITE', None, None, 'CHRONIC RENAL FAILURE/SDA', 0, 1),
 (6, 7, 'F', datetime.datetime(2121, 5, 23, 0, 0), None, None, None, 0, 6, 7, 118037, datetime.datetime(2121, 5, 23, 15, 5), datetime.datetime(2121, 5, 27, 11, 57), None, 'NEWBORN', 'PHYS REFERRAL/NORMAL DELI', 'HOME', 'Private', None, 'CATHOLIC', None, 'WHITE', None, None, 'NEWBORN', 0, 1),
 (7, 8, 'M', datetime.datetime(2117, 11, 20, 0, 0), None, None, None, 0, 7, 8, 159514, datetime.datetime(2117, 11, 20, 10, 22), datetime.datetime(2117, 11, 24, 14, 20), None, 'NEWBORN', 'PHYS REFERRAL/NORMAL DELI', 'HOME', 'Private', None, 'CATHOLIC', None, 'WHITE', None, None, 'NEWBORN', 0, 1),
 (8, 9, 'M', datetime.datetime(2108, 1, 26, 0, 0), datetime.datetime(2149, 11, 14, 0, 0), datetime.datetime(2149, 11, 14, 0, 0), datetime.datetime(2149, 11, 14, 0, 0), 1, 8, 9, 150750, datetime.datetime(2149, 11, 9, 13, 6), datetime.datetime(2149, 11, 14, 10, 15), datetime.datetime(2149, 11, 14, 10, 15), 'EMERGENCY', 'EMERGENCY ROOM ADMIT', 'DEAD/EXPIRED', 'Medicaid', None, 'UNOBTAINABLE', None, 'UNKNOWN/NOT SPECIFIED', datetime.datetime(2149, 11, 9, 11, 13), datetime.datetime(2149, 11, 9, 13, 18), 'HEMORRHAGIC CVA', 1, 1),
 (9, 10, 'F', datetime.datetime(2103, 6, 28, 0, 0), None, None, None, 0, 9, 10, 184167, datetime.datetime(2103, 6, 28, 11, 36), datetime.datetime(2103, 7, 6, 12, 10), None, 'NEWBORN', 'PHYS REFERRAL/NORMAL DELI', 'SHORT TERM HOSPITAL', 'Medicaid', None, 'UNOBTAINABLE', None, 'BLACK/AFRICAN AMERICAN', None, None, 'NEWBORN', 0, 1),
 (10, 11, 'F', datetime.datetime(2128, 2, 22, 0, 0), datetime.datetime(2178, 11, 14, 0, 0), None, datetime.datetime(2178, 11, 14, 0, 0), 1, 10, 11, 194540, datetime.datetime(2178, 4, 16, 6, 18), datetime.datetime(2178, 5, 11, 19, 0), None, 'EMERGENCY', 'EMERGENCY ROOM ADMIT', 'HOME HEALTH CARE', 'Private', None, 'OTHER', 'MARRIED', 'WHITE', datetime.datetime(2178, 4, 15, 20, 46), datetime.datetime(2178, 4, 16, 6, 53), 'BRAIN MASS', 0, 1)]

In [14]:
%%sql

SELECT * FROM mimiciii."cptevents"
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/mimic
10 rows affected.

[(317, 11743, 129545, 'ICU', None, '99232', 99232, None, 6, 'Evaluation and management', 'Hospital inpatient services', None),
 (318, 11743, 129545, 'ICU', None, '99232', 99232, None, 7, 'Evaluation and management', 'Hospital inpatient services', None),
 (319, 11743, 129545, 'ICU', None, '99232', 99232, None, 8, 'Evaluation and management', 'Hospital inpatient services', None),
 (320, 11743, 129545, 'ICU', None, '99232', 99232, None, 9, 'Evaluation and management', 'Hospital inpatient services', None),
 (321, 6185, 183725, 'ICU', None, '99223', 99223, None, 1, 'Evaluation and management', 'Hospital inpatient services', None),
 (322, 3663, 126380, 'ICU', None, '99223', 99223, None, 1, 'Evaluation and management', 'Hospital inpatient services', None),
 (323, 3663, 126380, 'ICU', None, '99233', 99233, None, 2, 'Evaluation and management', 'Hospital inpatient services', None),
 (324, 3663, 126380, 'ICU', None, '99232', 99232, None, 3, 'Evaluation and management', 'Hospital inpatient services', None),
 (325, 3663, 126380, 'ICU', None, '99231', 99231, None, 4, 'Evaluation and management', 'Hospital inpatient services', None),
 (326, 3663, 126380, 'ICU', None, '99231', 99231, None, 5, 'Evaluation and management', 'Hospital inpatient services', None)]

## Build Tables

Seems like best way is to some joins in SQL and use pandas to join the rest

In [15]:
pt_adm = pd.read_sql('''SELECT patients.gender, patients.dob, patients.dod, patients.dod_hosp, 
patients.dod_ssn, patients.expire_flag, admissions.*
FROM mimiciii."patients"
INNER JOIN mimiciii."admissions"
ON mimiciii."patients".subject_id = mimiciii."admissions".subject_id;''', engine)

In [16]:
pt_adm.columns

Index(['gender', 'dob', 'dod', 'dod_hosp', 'dod_ssn', 'expire_flag', 'row_id',
       'subject_id', 'hadm_id', 'admittime', 'dischtime', 'deathtime',
       'admission_type', 'admission_location', 'discharge_location',
       'insurance', 'language', 'religion', 'marital_status', 'ethnicity',
       'edregtime', 'edouttime', 'diagnosis', 'hospital_expire_flag',
       'has_chartevents_data'],
      dtype='object')

In [17]:
pt_adm.head()

,gender,dob,dod,dod_hosp,dod_ssn,expire_flag,row_id,subject_id,hadm_id,admittime,...,insurance,language,religion,marital_status,ethnicity,edregtime,edouttime,diagnosis,hospital_expire_flag,has_chartevents_data
0,M,2138-07-17,NaT,NaT,NaT,0,1,2,163353,2138-07-17 19:04:00,...,Private,None,NOT SPECIFIED,None,ASIAN,NaT,NaT,NEWBORN,0,1
1,M,2025-04-11,2102-06-14,NaT,2102-06-14,1,2,3,145834,2101-10-20 19:08:00,...,Medicare,None,CATHOLIC,MARRIED,WHITE,2101-10-20 17:09:00,2101-10-20 19:24:00,HYPOTENSION,0,1
2,F,2143-05-12,NaT,NaT,NaT,0,3,4,185777,2191-03-16 00:28:00,...,Private,None,PROTESTANT QUAKER,SINGLE,WHITE,2191-03-15 13:10:00,2191-03-16 01:10:00,"FEVER,DEHYDRATION,FAILURE TO THRIVE",0,1
3,M,2103-02-02,NaT,NaT,NaT,0,4,5,178980,2103-02-02 04:31:00,...,Private,None,BUDDHIST,None,ASIAN,NaT,NaT,NEWBORN,0,1
4,F,2109-06-21,NaT,NaT,NaT,0,5,6,107064,2175-05-30 07:15:00,...,Medicare,ENGL,NOT SPECIFIED,MARRIED,WHITE,NaT,NaT,CHRONIC RENAL FAILURE/SDA,0,1

In [18]:
pt_adm['subject_id'].head()

0    2
1    3
2    4
3    5
4    6
Name: subject_id, dtype: int64

In [19]:
cpt = pd.read_sql('''SELECT * FROM mimiciii."cptevents";''', engine)
cpt.head()

,row_id,subject_id,hadm_id,costcenter,chartdate,cpt_cd,cpt_number,cpt_suffix,ticket_id_seq,sectionheader,subsectionheader,description
0,317,11743,129545,ICU,NaT,99232,99232.0,None,6.0,Evaluation and management,Hospital inpatient services,None
1,318,11743,129545,ICU,NaT,99232,99232.0,None,7.0,Evaluation and management,Hospital inpatient services,None
2,319,11743,129545,ICU,NaT,99232,99232.0,None,8.0,Evaluation and management,Hospital inpatient services,None
3,320,11743,129545,ICU,NaT,99232,99232.0,None,9.0,Evaluation and management,Hospital inpatient services,None
4,321,6185,183725,ICU,NaT,99223,99223.0,None,1.0,Evaluation and management,Hospital inpatient services,None

In [20]:
callout = pd.read_sql('''SELECT * FROM mimiciii."callout";''', engine)
callout.head()

,row_id,subject_id,hadm_id,submit_wardid,submit_careunit,curr_wardid,curr_careunit,callout_wardid,callout_service,request_tele,...,callout_status,callout_outcome,discharge_wardid,acknowledge_status,createtime,updatetime,acknowledgetime,outcometime,firstreservationtime,currentreservationtime
0,402,854,175684,52.0,None,29.0,MICU,1,MED,0,...,Inactive,Discharged,29.0,Acknowledged,2146-10-05 13:16:55,2146-10-05 13:16:55,2146-10-05 13:24:00,2146-10-05 18:55:22,2146-10-05 15:27:44,NaT
1,403,864,138624,15.0,None,55.0,CSRU,55,CSURG,0,...,Inactive,Discharged,55.0,Acknowledged,2114-11-28 08:31:39,2114-11-28 09:42:08,2114-11-28 09:43:08,2114-11-28 12:10:02,NaT,NaT
2,404,864,138624,12.0,None,55.0,CSRU,55,CSURG,1,...,Inactive,Discharged,55.0,Acknowledged,2114-11-30 10:24:25,2114-12-01 09:06:18,2114-12-01 12:26:05,2114-12-01 21:55:05,NaT,NaT
3,405,867,184298,7.0,None,17.0,CCU,17,CCU,1,...,Inactive,Discharged,17.0,Acknowledged,2136-12-29 08:45:42,2136-12-29 10:17:16,2136-12-29 10:33:51,2136-12-29 18:10:02,NaT,NaT
4,157,306,167129,57.0,None,3.0,SICU,44,NSURG,1,...,Inactive,Discharged,3.0,Acknowledged,2199-09-18 11:47:47,2199-09-18 11:47:47,2199-09-18 11:58:33,2199-09-18 15:10:02,NaT,NaT

In [21]:
icustay = pd.read_sql('''SELECT * FROM mimiciii."icustays";''', engine)
icustay.head()

,row_id,subject_id,hadm_id,icustay_id,dbsource,first_careunit,last_careunit,first_wardid,last_wardid,intime,outtime,los
0,365,268,110404,280836,carevue,MICU,MICU,52,52,2198-02-14 23:27:38,2198-02-18 05:26:11,3.2490
1,366,269,106296,206613,carevue,MICU,MICU,52,52,2170-11-05 11:05:29,2170-11-08 17:46:57,3.2788
2,367,270,188028,220345,carevue,CCU,CCU,57,57,2128-06-24 15:05:20,2128-06-27 12:32:29,2.8939
3,368,271,173727,249196,carevue,MICU,SICU,52,23,2120-08-07 23:12:42,2120-08-10 00:39:04,2.0600
4,369,272,164716,210407,carevue,CCU,CCU,57,57,2186-12-25 21:08:04,2186-12-27 12:01:13,1.6202

In [22]:
svcs = pd.read_sql('''SELECT * FROM mimiciii."services";''', engine)
svcs.head()

   row_id  subject_id  hadm_id        transfertime prev_service curr_service
0     758         471   135879 2122-07-22 14:07:27        TSURG          MED
1     759         471   135879 2122-07-26 18:31:49          MED        TSURG
2     760         472   173064 2172-09-28 19:22:15         None         CMED
3     761         473   129194 2201-01-09 20:16:45         None           NB
4     762         474   194246 2181-03-23 08:24:41         None           NB

In [23]:
procicd = pd.read_sql('''SELECT * FROM mimiciii."procedures_icd";''', engine)
procicd.head()

   row_id  subject_id  hadm_id  seq_num icd9_code
0     944       62641   154460        3      3404
1     945        2592   130856        1      9671
2     946        2592   130856        2      3893
3     947       55357   119355        1      9672
4     948       55357   119355        2      0331

In [24]:
procicddesc = pd.read_sql('''SELECT * FROM mimiciii."d_icd_procedures";''', engine)
procicddesc.head()

,row_id,icd9_code,short_title,long_title
0,264,0851,Canthotomy,Canthotomy
1,265,0852,Blepharorrhaphy,Blepharorrhaphy
2,266,0859,Adjust lid position NEC,Other adjustment of lid position
3,267,0861,Lid reconst w skin graft,Reconstruction of eyelid with skin flap or graft
4,268,0862,Lid reconst w muc graft,Reconstruction of eyelid with mucous membrane ...

In [25]:
diagicd = pd.read_sql('''SELECT * FROM mimiciii."diagnoses_icd";''', engine)
diagicd.head()

   row_id  subject_id  hadm_id  seq_num icd9_code
0    1297         109   172335      1.0     40301
1    1298         109   172335      2.0       486
2    1299         109   172335      3.0     58281
3    1300         109   172335      4.0      5855
4    1301         109   172335      5.0      4254

In [26]:
diagicddesc = pd.read_sql('''SELECT * FROM mimiciii."d_icd_diagnoses";''', engine)
diagicddesc.head()

,row_id,icd9_code,short_title,long_title
0,174,01166,TB pneumonia-oth test,"Tuberculous pneumonia [any form], tubercle bac..."
1,175,01170,TB pneumothorax-unspec,"Tuberculous pneumothorax, unspecified"
2,176,01171,TB pneumothorax-no exam,"Tuberculous pneumothorax, bacteriological or h..."
3,177,01172,TB pneumothorx-exam unkn,"Tuberculous pneumothorax, bacteriological or h..."
4,178,01173,TB pneumothorax-micro dx,"Tuberculous pneumothorax, tubercle bacilli fou..."

Decision to not join description tables because only offer definitions that are unstructured data and don't contribute additional info.

In [73]:
pt_adm_cpt = pd.merge(pt_adm, cpt, how='inner', on=["subject_id", "hadm_id"])
pt_adm_cpt.head()

,gender,dob,dod,dod_hosp,dod_ssn,expire_flag,row_id_x,subject_id,hadm_id,admittime,...,row_id_y,costcenter,chartdate,cpt_cd,cpt_number,cpt_suffix,ticket_id_seq,sectionheader,subsectionheader,description
0,M,2025-04-11,2102-06-14,NaT,2102-06-14,1,2,3,145834,2101-10-20 19:08:00,...,474568,Resp,2101-10-21,94002,94002.0,None,NaN,Medicine,Pulmonary,"VENT MGMT, 1ST DAY (INVASIVE)"
1,M,2025-04-11,2102-06-14,NaT,2102-06-14,1,2,3,145834,2101-10-20 19:08:00,...,474569,Resp,2101-10-23,94003,94003.0,None,NaN,Medicine,Pulmonary,VENT MGMT;SUBSQ DAYS(INVASIVE)
2,M,2025-04-11,2102-06-14,NaT,2102-06-14,1,2,3,145834,2101-10-20 19:08:00,...,474570,Resp,2101-10-22,94003,94003.0,None,NaN,Medicine,Pulmonary,VENT MGMT;SUBSQ DAYS(INVASIVE)
3,M,2025-04-11,2102-06-14,NaT,2102-06-14,1,2,3,145834,2101-10-20 19:08:00,...,474571,Resp,2101-10-24,94003,94003.0,None,NaN,Medicine,Pulmonary,VENT MGMT;SUBSQ DAYS(INVASIVE)
4,F,2143-05-12,NaT,NaT,NaT,0,3,4,185777,2191-03-16 00:28:00,...,26369,ICU,NaT,99223,99223.0,None,1.0,Evaluation and management,Hospital inpatient services,None

In [74]:
pt_adm_cpt_callout = pd.merge(pt_adm_cpt, callout, how='inner', on=["subject_id", "hadm_id"])
pt_adm_cpt_callout.head()

,gender,dob,dod,dod_hosp,dod_ssn,expire_flag,row_id_x,subject_id,hadm_id,admittime,...,callout_status,callout_outcome,discharge_wardid,acknowledge_status,createtime,updatetime,acknowledgetime,outcometime,firstreservationtime,currentreservationtime
0,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,Inactive,Discharged,3.0,Acknowledged,2178-04-17 10:09:40,2178-04-17 10:09:40,2178-04-17 10:56:58,2178-04-17 20:40:02,NaT,NaT
1,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,Inactive,Discharged,3.0,Acknowledged,2178-04-17 10:09:40,2178-04-17 10:09:40,2178-04-17 10:56:58,2178-04-17 20:40:02,NaT,NaT
2,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,Inactive,Discharged,3.0,Acknowledged,2178-04-17 10:09:40,2178-04-17 10:09:40,2178-04-17 10:56:58,2178-04-17 20:40:02,NaT,NaT
3,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,Inactive,Discharged,3.0,Acknowledged,2178-04-17 10:09:40,2178-04-17 10:09:40,2178-04-17 10:56:58,2178-04-17 20:40:02,NaT,NaT
4,M,2116-11-29,NaT,NaT,NaT,0,16,18,188822,2167-10-02 11:18:00,...,Inactive,Discharged,3.0,Revised,2167-10-02 16:13:35,2167-10-03 12:01:03,NaT,2167-10-03 18:40:05,NaT,NaT

In [75]:
pt_adm_cpt_callout_icu = pd.merge(pt_adm_cpt_callout, icustay, how='inner', on=["subject_id", "hadm_id"])
pt_adm_cpt_callout_icu.head()

,gender,dob,dod,dod_hosp,dod_ssn,expire_flag,row_id_x,subject_id,hadm_id,admittime,...,row_id_y,icustay_id,dbsource,first_careunit,last_careunit,first_wardid,last_wardid,intime,outtime,los
0,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,11,229441,carevue,SICU,SICU,57,57,2178-04-16 06:19:32,2178-04-17 20:21:05,1.5844
1,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,11,229441,carevue,SICU,SICU,57,57,2178-04-16 06:19:32,2178-04-17 20:21:05,1.5844
2,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,11,229441,carevue,SICU,SICU,57,57,2178-04-16 06:19:32,2178-04-17 20:21:05,1.5844
3,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,11,229441,carevue,SICU,SICU,57,57,2178-04-16 06:19:32,2178-04-17 20:21:05,1.5844
4,M,2116-11-29,NaT,NaT,NaT,0,16,18,188822,2167-10-02 11:18:00,...,17,298129,carevue,CCU,CCU,7,7,2167-10-02 11:20:39,2167-10-03 18:16:05,1.2885

In [76]:
pt_adm_cpt_callout_icu_svcs = pd.merge(pt_adm_cpt_callout_icu, svcs, how='inner', on=["subject_id", "hadm_id"])
pt_adm_cpt_callout_icu_svcs.head()

,gender,dob,dod,dod_hosp,dod_ssn,expire_flag,row_id_x,subject_id,hadm_id,admittime,...,last_careunit,first_wardid,last_wardid,intime,outtime,los,row_id,transfertime,prev_service,curr_service
0,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,SICU,57,57,2178-04-16 06:19:32,2178-04-17 20:21:05,1.5844,11,2178-04-16 06:19:32,None,NSURG
1,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,SICU,57,57,2178-04-16 06:19:32,2178-04-17 20:21:05,1.5844,12,2178-05-03 20:37:32,NSURG,NMED
2,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,SICU,57,57,2178-04-16 06:19:32,2178-04-17 20:21:05,1.5844,11,2178-04-16 06:19:32,None,NSURG
3,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,SICU,57,57,2178-04-16 06:19:32,2178-04-17 20:21:05,1.5844,12,2178-05-03 20:37:32,NSURG,NMED
4,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,SICU,57,57,2178-04-16 06:19:32,2178-04-17 20:21:05,1.5844,11,2178-04-16 06:19:32,None,NSURG

In [79]:
pt_adm_cpt_callout_icu_svcs_procicd = pd.merge(pt_adm_cpt_callout_icu_svcs, procicd, how='inner', on=["subject_id", "hadm_id"])
pt_adm_cpt_callout_icu_svcs_procicd.head()

,gender,dob,dod,dod_hosp,dod_ssn,expire_flag,row_id_x,subject_id,hadm_id,admittime,...,intime,outtime,los,row_id_x,transfertime,prev_service,curr_service,row_id_y,seq_num,icd9_code
0,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,2178-04-16 06:19:32,2178-04-17 20:21:05,1.5844,11,2178-04-16 06:19:32,None,NSURG,107163,1,0159
1,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,2178-04-16 06:19:32,2178-04-17 20:21:05,1.5844,11,2178-04-16 06:19:32,None,NSURG,107164,2,0113
2,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,2178-04-16 06:19:32,2178-04-17 20:21:05,1.5844,11,2178-04-16 06:19:32,None,NSURG,107165,3,0113
3,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,2178-04-16 06:19:32,2178-04-17 20:21:05,1.5844,11,2178-04-16 06:19:32,None,NSURG,107166,4,9229
4,F,2128-02-22,2178-11-14,NaT,2178-11-14,1,10,11,194540,2178-04-16 06:18:00,...,2178-04-16 06:19:32,2178-04-17 20:21:05,1.5844,11,2178-04-16 06:19:32,None,NSURG,107167,5,9925

In [28]:
svcs.shape

(73343, 6)

In [ ]:
pt_adm_cpt_callout_icu_svcs_procicd_diagicd = pd.merge(pt_adm_cpt_callout_icu_svcs_procicd, diagicd, how='inner', on=["subject_id", "hadm_id"])
pt_adm_cpt_callout_icu_svcs_procicd_diagicd.head()

## Set the final db

In [ ]:
final_db = pt_adm_cpt_callout_icu_svcs_procicd_diagicd